Tekla Open API Reference for Tekla Structures 2025
AlongLinePlacing Class
 The AlongLinePlacing class defines a placing where the object is located and moved along a line defined by two points.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.PlacingBase
 Tekla.Structures.Drawing.AlongLinePlacing
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class AlongLinePlacing : PlacingBase
<SerializableAttribute>
Public Class AlongLinePlacing
	Inherits PlacingBase
The AlongLinePlacing type exposes the following members.
Constructors
Name | Description
AlongLinePlacing
 Creates a new along line placing instance. The given two points define the line to be used for the placing.
Top
Properties
Name | Description
EndPoint
 The end point of the line that the object is placed on.
StartPoint
 The start point of the line that the object is placed on.
Top
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides PlacingBase.IsEqual(Object).)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace